# To predict the cost required to ship these sculptures to customers based on the information provided in the dataset.

In [31]:
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np

%matplotlib inline

### load the data

In [32]:
df = pd.read_csv('train.csv')
df.head()

,Customer Id,Artist Name,Artist Reputation,Height,Width,Weight,Material,Price Of Sculpture,Base Shipping Price,International,Express Shipment,Installation Included,Transport,Fragile,Customer Information,Remote Location,Scheduled Date,Delivery Date,Customer Location,Cost
0,fffe3900350033003300,Billy Jenkins,0.26,17.0,6.0,4128.0,Brass,13.91,16.27,Yes,Yes,No,Airways,No,Working Class,No,06/07/15,06/03/15,"New Michelle, OH 50777",-283.29
1,fffe3800330031003900,Jean Bryant,0.28,3.0,3.0,61.0,Brass,6.83,15.00,No,No,No,Roadways,No,Working Class,No,03/06/17,03/05/17,"New Michaelport, WY 12072",-159.96
2,fffe3600370035003100,Laura Miller,0.07,8.0,5.0,237.0,Clay,4.96,21.18,No,No,No,Roadways,Yes,Working Class,Yes,03/09/15,03/08/15,"Bowmanshire, WA 19241",-154.29
3,fffe350031003300,Robert Chaires,0.12,9.0,NaN,NaN,Aluminium,5.81,16.31,No,No,No,NaN,No,Wealthy,Yes,05/24/15,05/20/15,"East Robyn, KY 86375",-161.16
4,fffe3900320038003400,Rosalyn Krol,0.15,17.0,6.0,324.0,Aluminium,3.18,11.94,Yes,Yes,Yes,Airways,No,Working Class,No,12/18/16,12/14/16,"Aprilside, PA 52793",-159.23

In [33]:
df.shape

(6500, 20)

### we will find corelation between features and target

In [34]:
df['Material'] = df['Material'].astype('category').cat.codes
df['International'] = df['International'].astype('category').cat.codes
df['Express Shipment'] = df['Express Shipment'].astype('category').cat.codes
df['Installation Included'] = df['Installation Included'].astype('category').cat.codes
df['Transport'] = df['Transport'].astype('category').cat.codes
df['Fragile'] = df['Fragile'].astype('category').cat.codes
df['Customer Information'] = df['Customer Information'].astype('category').cat.codes
df['Remote Location'] = df['Remote Location'].astype('category').cat.codes

In [35]:
df[df.columns[2:]].corr()['Cost'][:]

Artist Reputation        0.067368
Height                   0.106047
Width                    0.158159
Weight                   0.417263
Material                 0.037244
Price Of Sculpture       0.476231
Base Shipping Price      0.053068
International            0.004685
Express Shipment         0.033563
Installation Included    0.019587
Transport               -0.018973
Fragile                  0.006353
Customer Information    -0.003510
Remote Location          0.006011
Cost                     1.000000
Name: Cost, dtype: float64

### we will check the correlation between subset of dataset to cost

In [36]:
df[['Price Of Sculpture','Height','Width','Weight','Cost']].corr()['Cost'][:]

Price Of Sculpture    0.476231
Height                0.106047
Width                 0.158159
Weight                0.417263
Cost                  1.000000
Name: Cost, dtype: float64

In [37]:
new_df = df[['Price Of Sculpture','Height','Width','Weight','Cost']]
new_df.head()

   Price Of Sculpture  Height  Width  Weight    Cost
0               13.91    17.0    6.0  4128.0 -283.29
1                6.83     3.0    3.0    61.0 -159.96
2                4.96     8.0    5.0   237.0 -154.29
3                5.81     9.0    NaN     NaN -161.16
4                3.18    17.0    6.0   324.0 -159.23

# Cleaning of data

In [38]:
new_df.replace([np.inf, -np.inf], np.nan, inplace=True)
new_df.fillna(999, inplace=True)

C:\Users\PRIYAMATE\Anaconda3\lib\site-packages\pandas\core\frame.py:4263: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  method=method,
C:\Users\PRIYAMATE\Anaconda3\lib\site-packages\pandas\core\frame.py:4244: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  **kwargs

In [39]:
new_df.head()

   Price Of Sculpture  Height  Width  Weight    Cost
0               13.91    17.0    6.0  4128.0 -283.29
1                6.83     3.0    3.0    61.0 -159.96
2                4.96     8.0    5.0   237.0 -154.29
3                5.81     9.0  999.0   999.0 -161.16
4                3.18    17.0    6.0   324.0 -159.23

In [40]:
np.where(np.isnan(new_df))

(array([], dtype=int64), array([], dtype=int64))

In [41]:
np.nan_to_num(new_df)

array([[ 1.391000e+01,  1.700000e+01,  6.000000e+00,  4.128000e+03,
        -2.832900e+02],
       [ 6.830000e+00,  3.000000e+00,  3.000000e+00,  6.100000e+01,
        -1.599600e+02],
       [ 4.960000e+00,  8.000000e+00,  5.000000e+00,  2.370000e+02,
        -1.542900e+02],
       ...,
       [ 6.920000e+00,  1.900000e+01,  8.000000e+00,  5.870000e+02,
         3.545500e+02],
       [ 2.929130e+03,  3.300000e+01,  9.000000e+00,  1.269377e+06,
         5.037500e+03],
       [ 4.663000e+01,  3.000000e+01,  1.300000e+01,  3.472900e+04,
         7.224700e+02]])

In [42]:
np.where(new_df.values >= np.finfo(np.float64).max)

(array([], dtype=int64), array([], dtype=int64))

## Split the data

In [43]:
X_features = new_df[['Price Of Sculpture','Height','Width','Weight']]
Y_target = new_df['Cost']

# Building a model

# using linear regression

In [57]:
from sklearn import linear_model

In [58]:
l_reg = linear_model.LinearRegression()

In [67]:
model_2 = l_reg.fit(X_features,Y_target)

# loading test.csv

In [62]:
df1 = pd.read_csv('test.csv')
df1.head()

,Customer Id,Artist Name,Artist Reputation,Height,Width,Weight,Material,Price Of Sculpture,Base Shipping Price,International,Express Shipment,Installation Included,Transport,Fragile,Customer Information,Remote Location,Scheduled Date,Delivery Date,Customer Location
0,fffe3400310033003300,James Miller,0.35,53.0,18.0,871.0,Wood,5.98,19.11,Yes,Yes,No,Airways,No,Working Class,No,07/03/17,07/06/17,"Santoshaven, IA 63481"
1,fffe3600350035003400,Karen Vetrano,0.67,7.0,4.0,108.0,Clay,6.92,13.96,No,No,No,Roadways,Yes,Working Class,No,05/02/16,05/02/16,"Ericksonton, OH 98253"
2,fffe3700360030003500,Roseanne Gaona,0.61,6.0,5.0,97.0,Aluminium,4.23,13.62,Yes,No,No,Airways,No,Working Class,No,01/04/18,01/06/18,APO AP 83453
3,fffe350038003600,Todd Almanza,0.14,15.0,8.0,757.0,Clay,6.28,23.79,No,Yes,No,Roadways,Yes,Wealthy,No,09/14/17,09/17/17,"Antonioborough, AL 54778"
4,fffe3500390032003500,Francis Rivero,0.63,10.0,4.0,1673.0,Marble,4.39,17.83,No,Yes,Yes,Roadways,No,Working Class,Yes,12/03/17,12/02/17,"Lake Frances, LA 03040"

In [66]:
x = df1[['Price Of Sculpture','Height','Width','Weight']]
x

      Price Of Sculpture  Height  Width    Weight
0                   5.98    53.0   18.0     871.0
1                   6.92     7.0    4.0     108.0
2                   4.23     6.0    5.0      97.0
3                   6.28    15.0    8.0     757.0
4                   4.39    10.0    4.0    1673.0
...                  ...     ...    ...       ...
3495               78.01    13.0    6.0   23511.0
3496              214.85    29.0   14.0       NaN
3497                8.91    12.0    6.0       NaN
3498                6.75    17.0    9.0     565.0
3499             4768.42    25.0   11.0  989903.0

[3500 rows x 4 columns]

# cleaning test data

In [70]:
x.replace([np.inf, -np.inf], np.nan, inplace=True)
x.fillna(999, inplace=True)

In [72]:
np.where(np.isnan(x))

(array([], dtype=int64), array([], dtype=int64))

In [73]:
np.nan_to_num(x)

array([[5.98000e+00, 5.30000e+01, 1.80000e+01, 8.71000e+02],
       [6.92000e+00, 7.00000e+00, 4.00000e+00, 1.08000e+02],
       [4.23000e+00, 6.00000e+00, 5.00000e+00, 9.70000e+01],
       ...,
       [8.91000e+00, 1.20000e+01, 6.00000e+00, 9.99000e+02],
       [6.75000e+00, 1.70000e+01, 9.00000e+00, 5.65000e+02],
       [4.76842e+03, 2.50000e+01, 1.10000e+01, 9.89903e+05]])

In [76]:
np.where(x.values >= np.finfo(np.float64).max)

(array([], dtype=int64), array([], dtype=int64))

# predict test data

In [77]:
pred = model_2.predict(x)
print("prediction :",pred)
a_score = l_reg.score(X_features,Y_target)
print("R^2 value :",a_score)

prediction : [ 2136.03827672  2142.6140758   2102.6300925  ...  2167.13933724
  2138.7058022  65282.83946483]
R^2 value : 0.22772497699542515

# sample test cases

In [79]:
df2 = pd.read_csv('sample_submission.csv')
df2

            Customer Id    Cost
0  fffe3900350033003300  283.29
1  fffe3800330031003900  159.96
2  fffe3600370035003100  154.29
3      fffe350031003300  161.16
4  fffe3900320038003400  159.23

In [81]:
data = {
    "customer_Id" : df1['Customer Id':]
    "Cost" : pred    
}
data

SyntaxError: invalid syntax (<ipython-input-81-410d698544d5>, line 3)

In [83]:
customer_Id=df1['Customer Id']
Cost=pred

In [84]:
print("customer_Id ",customer_Id)
print("Cost ",Cost)

customer_Id  0       fffe3400310033003300
1       fffe3600350035003400
2       fffe3700360030003500
3           fffe350038003600
4       fffe3500390032003500
                ...
3495    fffe3200300037003100
3496        fffe390031003100
3497    fffe3200350031003700
3498    fffe3100380031003000
3499    fffe3200340037003300
Name: Customer Id, Length: 3500, dtype: object
Cost  [ 2136.03827672  2142.6140758   2102.6300925  ...  2167.13933724
  2138.7058022  65282.83946483]

In [87]:
customer_Id.shape
type(customer_Id)

pandas.core.series.Series

In [88]:
Cost.shape
type(Cost)

numpy.ndarray

In [91]:
columns = ['Customer Id','Cost']
cost = pd.Series(
            data = Cost,
            
)
cost

0        2136.038277
1        2142.614076
2        2102.630093
3        2130.523800
4        2098.123291
            ...
3495     3035.968123
3496     5151.828778
3497     2167.139337
3498     2138.705802
3499    65282.839465
Length: 3500, dtype: float64

In [93]:
data ={
    "Customer Id" : customer_Id,
    "Cost" : cost
}

In [94]:
output = pd.concat(data,axis=1)
output

               Customer Id          Cost
0     fffe3400310033003300   2136.038277
1     fffe3600350035003400   2142.614076
2     fffe3700360030003500   2102.630093
3         fffe350038003600   2130.523800
4     fffe3500390032003500   2098.123291
...                    ...           ...
3495  fffe3200300037003100   3035.968123
3496      fffe390031003100   5151.828778
3497  fffe3200350031003700   2167.139337
3498  fffe3100380031003000   2138.705802
3499  fffe3200340037003300  65282.839465

[3500 rows x 2 columns]

# saving file as csv

In [95]:
output.to_csv('Cost_Pred_output.csv')